tap "homebrew/bundle"
brew "cmatrix"
brew "ffmpeg"
brew "fzf"
brew "neovim"
brew "oh-my-posh"
brew "ripgrep"
brew "vim"
brew "yt-dlp"
cask "blender"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "font-jetbrains-mono"
cask "ghostty"
cask "obsidian"
cask "private-internet-access"
cask "raycast"
cask "shottr"
cask "spotify"
cask "zed"