brew "cmatrix"
brew "ffmpeg"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "node"
brew "oh-my-posh"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "vim"
brew "yt-dlp"
cask "blender"
cask "discord"
cask "docker-desktop"
cask "duckduckgo"
cask "figma"
cask "font-jetbrains-mono"
cask "ghostty"
cask "gimp"
cask "obsidian"
# cask "private-internet-access"
cask "raycast"
cask "shottr"
cask "spotify"
cask "steam"
# cask "ungoogled-chromium"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
# vscode "chadbaileyvh.oled-pure-black---vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "tomoki1207.pdf"
